In [1]:
%pip install quandl
import quandl as ql
import numpy as np
import pandas as pd
import matplotlib.pylab as plt
from sklearn.linear_model import LinearRegression as lr

Requirement already satisfied: quandl in /opt/anaconda3/lib/python3.8/site-packages (3.5.2)
Requirement already satisfied: python-dateutil in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (2.8.1)
Requirement already satisfied: six in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (1.15.0)
Requirement already satisfied: more-itertools in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (8.4.0)
Requirement already satisfied: pandas>=0.14 in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (1.1.3)
Requirement already satisfied: inflection>=0.3.1 in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (0.5.1)
Requirement already satisfied: requests>=2.7.0 in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (2.24.0)
Requirement already satisfied: numpy>=1.8 in /opt/anaconda3/lib/python3.8/site-packages (from quandl) (1.18.5)
Requirement already satisfied: pytz>=2017.2 in /opt/anaconda3/lib/python3.8/site-packages (from pandas>=0.14->quandl) (2020.1)
Requirement already satisfied: chardet<4,>=3.0.2 in /opt/anaconda3/lib/python3.8/site-packages (from requests>=2.7.0->quandl) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /opt/anaconda3/lib/python3.8/site-packages (from requests>=2.7.0->quandl) (2020.6.20)
Requirement already satisfied: idna<3,>=2.5 in /opt/anaconda3/lib/python3.8/site-packages (from requests>=2.7.0->quandl) (2.10)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /opt/anaconda3/lib/python3.8/site-packages (from requests>=2.7.0->quandl) (1.25.9)
Note: you may need to restart the kernel to use updated packages.

In [2]:
tza = ql.get("PSE/ANNINC992I_PALL_TZ", authtoken="-K72dVjJWtM7ztFbz-95") # Tanzania data
ken = ql.get("PSE/ANNINC992I_PALL_KE", authtoken="-K72dVjJWtM7ztFbz-95") # Kenya data
uga = ql.get("PSE/ANNINC992I_PALL_UG", authtoken="-K72dVjJWtM7ztFbz-95") # Uganda data

In [3]:
tza.head(3)

                 Value
Date
1950-12-31  1478838.75
1951-12-31  1634645.50
1952-12-31  1620628.75

In [4]:
uga.index

DatetimeIndex(['1950-12-31', '1951-12-31', '1952-12-31', '1953-12-31',
               '1954-12-31', '1955-12-31', '1956-12-31', '1957-12-31',
               '1958-12-31', '1959-12-31', '1960-12-31', '1961-12-31',
               '1962-12-31', '1963-12-31', '1964-12-31', '1965-12-31',
               '1966-12-31', '1967-12-31', '1968-12-31', '1969-12-31',
               '1970-12-31', '1971-12-31', '1972-12-31', '1973-12-31',
               '1974-12-31', '1975-12-31', '1976-12-31', '1977-12-31',
               '1978-12-31', '1979-12-31', '1980-12-31', '1981-12-31',
               '1982-12-31', '1983-12-31', '1984-12-31', '1985-12-31',
               '1986-12-31', '1987-12-31', '1988-12-31', '1989-12-31',
               '1990-12-31', '1991-12-31', '1992-12-31', '1993-12-31',
               '1994-12-31', '1995-12-31', '1996-12-31', '1997-12-31',
               '1998-12-31', '1999-12-31', '2000-12-31', '2001-12-31',
               '2002-12-31', '2003-12-31', '2004-12-31', '2005-12-31',
               '2006-12-31', '2007-12-31', '2008-12-31', '2009-12-31',
               '2010-12-31', '2011-12-31', '2012-12-31', '2013-12-31',
               '2014-12-31', '2015-12-31'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [5]:
tanzanian_data = tza['Value']
tanzanian_data.columns = ['Tanzania']
kenyan_data = ken['Value']
kenyan_data.columns = ['Kenya']
ugandan_data = uga['Value']
ugandan_data.columns = ['Uganda']

In [6]:
merged_inner = pd.merge(left=tanzanian_data, right=kenyan_data, left_on='Date', right_on='Date')
# In this case `species_id` is the only column name in  both dataframes, so if we skipped `left_on`
# And `right_on` arguments we would still get the same result

# What's the size of the output data?
merged_inner.shape
merged_inner

                Value_x        Value_y
Date
1950-12-31  1478838.750  136330.765625
1951-12-31  1634645.500  164822.718750
1952-12-31  1620628.750  142518.484375
1953-12-31  1510832.875  135623.468750
1954-12-31  1593558.750  148888.125000
...                 ...            ...
2011-12-31  3111927.500  242232.500000
2012-12-31  3180691.750  245299.328125
2013-12-31  3312852.750  251548.343750
2014-12-31  3458366.250  255467.734375
2015-12-31  3573322.500  263548.500000

[66 rows x 2 columns]

In [7]:
result = pd.concat([tanzanian_data, kenyan_data, ugandan_data], axis=1)

In [8]:
result.head(3)

                 Value          Value      Value
Date
1950-12-31  1478838.75  136330.765625  2316104.5
1951-12-31  1634645.50  164822.718750  2153273.5
1952-12-31  1620628.75  142518.484375  2237281.0

In [9]:
#result = result['Value','Value','Value']
#result.head()

In [10]:
result.columns = ['Tanzania', 'Kenya', 'Uganda']
result.head(3)

              Tanzania          Kenya     Uganda
Date
1950-12-31  1478838.75  136330.765625  2316104.5
1951-12-31  1634645.50  164822.718750  2153273.5
1952-12-31  1620628.75  142518.484375  2237281.0